app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."completed" = ? ORDER BY id DESC  [["completed", false]]
---
  def index
    @tasks = Task.all.order(:completed, :priority)

SELECT  "tasks".* FROM "tasks" WHERE (id < 1) ORDER BY "tasks"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def show
    @task = Task.find(params[:id])

INSERT INTO "tasks" ("title", "description", "created_at", "updated_at", "priority", "due") VALUES (?, ?, ?, ?, ?, ?)  [["title", "run"], ["description", "Go for a run"], ["created_at", 2017-03-23 01:13:30 UTC], ["updated_at", 2017-03-23 01:13:30 UTC], ["priority", "High"], ["due", Wed, 22 Mar 2017]]
---
  def create
    @task = Task.new(task_params)

    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", Wed, 22 Mar 2017], ["updated_at", 2017-03-23 02:35:40 UTC], ["id", 32]]
---
  def complete
    @task = Task.find(params[:id])
    if @task.completed == nil
      @task.completed = Time.now
    else
      @task.completed = nil
    end
    @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "title" = ?, "description" = ?, "duedate" = ?, "priority" = ?, "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "PET A BEAR"], ["description", "very carefully"], ["duedate", "now"], ["priority", "yes"], ["completed", false], ["updated_at", 2017-03-22 20:37:56 UTC], ["id", 21]]
---
  def update
    @task = Task.find(params[:id])

    if @task.update(task_params)

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 5]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def destroy
    @task = Task.find(params[:id]).destroy